openfoam_data/simulation/fene_p/single_obstacle/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

 echo "Running blockMesh application"
 runApplication blockMesh

 echo "Running viscoelasticFluidFoam solver"
 echo "FENE-P model:"
 runApplication $application

 echo "Running stressDifferences application"
 runApplication stressDifferences

 echo "Running sample application"
 runApplication sample

 echo "Simulation done"
