openfoam_data/simulation/fene_p/single_obstacle/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat     raw;

sets
(
    // Upstream sampling lines (before obstruction - Block 1)
    fig7_x_037
    {
        type            uniform;
        axis            y;
        start           (22 0 0.05);    // Block 1 (lower part)
        end             (22 3 0.05);    // Block 1 (upper part)
        nPoints         100;
    }

    fig7_x_05
    {
        type            uniform;
        axis            y;
        start           (21 0 0.05);    // Block 1 (lower part)
        end             (21 3 0.05);    // Block 1 (upper part)
        nPoints         100;
    }

    fig7_x_1
    {
        type            uniform;
        axis            y;
        start           (20.5 0 0.05);  // Block 1 (lower part)
        end             (20.5 3 0.05);  // Block 1 (upper part)
        nPoints         100;
    }

    // Sampling line at obstruction (Block 4)
    fig7_x_2
    {
        type            uniform;
        axis            y;
        start           (55 0 0.05);    // Block 4 (lower part)
        end             (55 3 0.05);    // Block 4 (upper part)
        nPoints         100;
    }

    // Downstream sampling lines (after obstruction - Block 5-7)
    fig10_x_05
    {
        type            uniform;
        axis            y;
        start           (75 0 0.05);    // Block 5 (lower part)
        end             (75 3 0.05);    // Block 7 (upper part)
        nPoints         100;
    }

    fig10_x_1
    {
        type            uniform;
        axis            y;
        start           (90 0 0.05);    // Block 5 (lower part)
        end             (90 3 0.05);    // Block 7 (upper part)
        nPoints         100;
    }

    // Horizontal sampling lines at different heights
    fig11_y_0
    {
        type            uniform;
        axis            x;
        start           (20 0 0.05);    // Block 1 (bottom line)
        end             (90 0 0.05);    // Block 5 (bottom line)
        nPoints         100;
    }

    fig11_y_04
    {
        type            uniform;
        axis            x;
        start           (20 1.5 0.05);  // Block 2 (middle line)
        end             (90 1.5 0.05);  // Block 6 (middle line)
        nPoints         100;
    }

    fig11_y_1
    {
        type            uniform;
        axis            x;
        start           (20 3 0.05);    // Block 3 (top line)
        end             (90 3 0.05);    // Block 7 (top line)
        nPoints         100;
    }
);

surfaceFormat null;

surfaces
();

fields
(
    N1
);

// ************************************************************************* //